SET IDENTITY_INSERT [dbo].[Study] ON
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (1, N'Hello World', N'בתוכנית זו נלמד איך מדפיסים למסך hello world:
include = פעולה שאומרת בעצם איזה ספרייה לכלול בתוך התוכנית (במקרה שלנו את הספרייה הכללית).
stdio.h = הספרייה הכללית (נמצאת בכל תוכנית שלנו).
void main() = התוכנית הראשית שלנו – כל הקוד שירוץ בתוכנית שלנו יתחם על ידי סוגריים מסולסלים.
printf("") = פעולת הדפסה בסיסית – נרשום את מה שאנו רוצים להדפיס בתוך הגרשיים שבתוך הסוגריים.')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (2, N'משתנים', N'משתנים הינם עצמים שמטרתם לשמור סוגי נתונים שונים.
כל סוג משתנה תופס כמות שונה של מקום בזיכרון.

int:
משתנה מסוג int הוא משתנה שתופס 4 בתים בזיכרון והוא מכיל מספרים שלמים כמו 1,2,3,4,5 וכו''.

double:
משתנה מסוג double הוא משתנה שתופס 8 בתים בזיכרון והוא מכיל מספרים שלמים ועשרוניים כמו: 1, 2, 3.1, 31 וכו''.

char:
משתנה מסוג char הוא משתנה שתופס ביט אחד בזיכרון והוא מכיל תווים כמו: a A , : ; 1 2 ^.

float:
משתנה מסוג float זהה למשתנה מסוג double , ההבדל בין סוגי משתנים אלה זה שfloat נותן לנו עד 7 מספרים אחרי הנקודה העשרונית ו double נותן לנו 15.')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (3, N'קלט פלט', N'פלט:

בשפת c יש לנו אופציה להדפיס למסך / למשתמש שלנו דברים באמצעות פקודת printf() (שעליה הסברנו בתוכנית הראשונה שלנו).
בנוסף יש לנו אופציה להדפיס משתנים (שעליהם הסברנו בעמוד משתנים ) בצורה הבאה:
printf("%kind",var);‎
הסבר:
printf("%left",right) = פקודת ההדפסה שלנו – במקרה שלנו אנחנו רושמים בצד שמאל % ואת סוג המשתנה שאותו אנו מדפיסים ובצד ימין אנו רושמים את שם המשתנה שאותו אנו מדפיסים.

קלט:

בשפת c יש אופציה לקלוט מידע מהמשתמש שלנו באמצעות פקודת scanf() שעליה נסביר:
scanf("%kind", &name_of_variable);
הסבר:
פקודה שבה אנו מכניסים ערך לתוך המשתנה שנמצא בצד ימין, גם פה אנו צריכים להגיד מאיזה סוג משתנה אנחנו מקבלים מידע scanf("%left",&right); .')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (4, N'אופרטורים', N'
+ פעולת חיבור.
/ פעולה חילוק.
- פעולת חיסור.
* פעולת כפל.
% מודולו - אופרטור שבעצם אומר לנו מהי שארית החלוקה של מספר במספר אחר.
() סוגריים.
= השמה - זוהי בעצם פעולה שאומרת בתכנות שמה שנמצא בצד שמאל מקבל את הערך שנמצא בצד ימין.')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (5, N'משפטי תנאי', N'
משפט שעל פיו אפשר לקבוע אמת / שקר נקרא - משפט בוליאני.
if() - פעולה שבודקת האם מה שבתוך הסוגריים מתקיים - אם כן אנחנו נכנסים לתוך הקוד שימצא בתוך סוגריים מסולסלים.
else - פעולה שנעשית אם ורק אם פעולת הif שקדמה לה לא התקיימה - גם פה , במידה ואנחנו מגלים שה else התקיים אנחנו נכנסים לתוך קטע הקוד שימצא בתוך סוגרים מסולסלים.
else if() - זוהי בדיקה שעובדת לאחר שיש if לפניה.
הבדיקה תיעשה אם ורק אם הif הקודם שלנו לא התקיים')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (6, N'לולאות', N'
אנו משתמשים בלולאות כאשר יש צורך ברשימת קוד רב ש"חוזר על עצמו" או כמעט "חוזר על עצמו".
לולאה בודקת תנאי מסוים בהתחלה ולאחר מכן במידה והטענה התקבלה כלא שגויה מתבצע קטע קוד שנמצא בתוך סוגריים מסולסלים (בדרך כלל, קיימת החרגה אם הלולאה מבצעת פעולה אחת בלבד).

סוגי לולאות:
לולאת for – לולאה שרצה מהגודל של האינדקס i עד לתנאי העצירה וגדלה בקצב קבוע.
לולאת while – לולאה שרצה עד שהתנאי שבתוך הסוגריים העגולים לא מתקיים.
לולאת do while – לולאת while שהתוספת שלה היא שמתבצע קוד לפני הבדיקה
(do = תעשה , while = תבדוק).')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (7, N'מצביעים', N'למה צריך מצביע?
נגיד שאנחנו רוצים לבנות פונקציה שמשנה את הערכים של כמה משתנים שנשלחים לפונקציה.
עד עכשיו לא היה באפשרותנו לעשות זאת, לאחר שנלמד על מצביעים נוכל.

מה זה מצביע?
מצביע הינו משתנה אשר מכיל כתובת של משתנים אחרים.

יצירת משתנה מסוג מצביע:
אנו יוצרים משתנה מסוג מצביע בצורה הבאה:
Type *name;

Type – אומר מאיזה מסוג המצביע שלנו.
Name – השם של המצביע.
סימון:
* - הסימן של הכוכבית מבדיל את המשתנה מהמשתנים האחרים ואומר למחשב שזה משתנה מסוג מצביע.
& - בעזרת הסימון הזה אנחנו יכולים לקבל כתובת של משתנה מסויים וניתן להדפיס אותה בתור מספר בעזרת %d או כתובת hex בעזרת %x.')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (8, N'מערכים ומחרוזות', N'מהו מערך?
מערך הוא מבנה נתונים שביכולתו לאסוף הרבה מאוד נתונים מאותו הסוג באותו המקום.
נראה דוגמה למתי נוח לנו לעבוד עם מערך:
עלינו ליצור תוכנה שבה יש כיתה שלמה של סטודנטים שמהם אנחנו קולטים ציון ומחזירים ממוצע כיתתי.
כדי לעשות זאת עלינו ליצור כ-30 תלמידים, לעשות קליטה של כ-30 ציונים ולאחר מכן לחשב את הממוצע ולהחזיר אותו

מהי מחרוזת ?
אוסף של תווים (char ''s ) שיוצרים לנו מילה , משפט או בעצם כל דבר אחר.
למשל: "1252s!@#" היא מחרוזת.
לצערנו , בשפת c טיפוס בשם מחרוזת לא קיים ואנו צריכים לעבוד עם מערך של chars ולקרוא לספרייה בשם string.h כדי לקבל את כל היכולות של מחרוזות לקוד שלנו.')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (9, N'פונקציות', N'פונקציות זו שיטה לחלק את הקוד שלנו לחלקים קטנים וקריאים יותר.
עיקרון ששווה ליישם בתור מתכנתים זה לנסות לדאוג שהקוד שלנו יהיה מחולק בצורה טובה לחתיכות קטנות יותר ובעצם לחבר את הכל בסוף.
פונקציות מאוד נוחות לעבודה משום שהן עוזרות לנו לכתוב פחות קוד מיותר.')
INSERT INTO [dbo].[Study] ([Id], [Subject], [Information]) VALUES (10, N'מבנים', N'מבנה הוא טיפוס חדש, שאנו מגדירים את שמו ואת מרכיביו כרצוננו. למבנה יש שדות, שהם איברים בעלי טיפוסים ושמות שאנו בוחרים.

לדוגמה, בדוגמה שראינו בצורך במבנים, נרצה ליצור טיפוס חדש שייקרא item. מבנה זה יכיל את השדות הבאים:

מספר קטלוגי, מסוג שלם
שם, מסוג מחרוזת בעלת 20 תווים לכל היותר
מחיר, מסוג נקודה צפה
כמות (כמה יש במלאי), מסוג שלם לא-שלילי')
SET IDENTITY_INSERT [dbo].[Study] OFF
